Revit 2026 API

# RevitLinkOptions Class

---

This class contains the options in use when creating or loading a Revit link.

SystemObject Autodesk.Revit.DBRevitLinkOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitLinkOptions : IDisposable
```
```vb
Public Class RevitLinkOptions
	Implements IDisposable
```
```cpp
public ref class RevitLinkOptions : IDisposable
```
```fsharp
type RevitLinkOptions =
    class
        interface IDisposable
    end
```

The RevitLinkOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RevitLinkOptions(Boolean) | Creates a RevitLinkOptions object, specifying relative or absolute path type. If the link is workshared, all worksets will be opened. |
|  | RevitLinkOptions(RevitLinkOptions) | Constructs a new copy of the input RevitLinkOptions object. |
|  | RevitLinkOptions(Boolean, WorksetConfiguration) | Creates a RevitLinkOptions object, specifying relative or absolute path type, and the desired workset configuration. |

|  | Name | Description |
| --- | --- | --- |
|  | IsRelative | The type of path to use when creating the link. If true, Revit will store a relative path for the link. If false, Revit will store an absolute path. If the link is to a Revit Server location, isRelative must be false. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RevitLinkOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWorksetConfiguration | Gets the set of worksets to open when creating the link. |
|  | SetWorksetConfiguration | Sets the set of worksets to open when creating the link. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace